src/ПодсистемаPAPI/InformationRegisters/PAPI_ОтборыПолучателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>PAPI_ОтборыПолучателей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Реквизит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PAPI_Участники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ПодсистемаPAPI/Enums/PAPI_ТипЛога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>PAPI_ТипЛога</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Информация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предупреждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Примечание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/ПодсистемаPAPI/InformationRegisters/PAPI_ОтборыПолучателей/Ext/ManagerModule.bsl
// Выборка получателей по ссылочным реквизитам. Служит для фильтрации объектов по базам получателям. (Нужно переделать)
//
// Параметры:
//  Объект		 - ЛюбаяСсылка, Объект - Объект содержащий в себе фильтруемую информацию
//	ТипОбъекта	 - Строка - Текстовое представление типа объекта
//  Реквизиты	 - Массив - Массив содержащий наименование реквизитов
//	ТипУИ  		 - Булево - Если истина тогда уникальный идентификатор в противном случае навигационная ссылка
// 
// Возвращаемое значение:
//  Строка - Перечень получателей для СообщениеСервисаИнтеграции.КодПолучателя 
//
Функция ПолучателиОтборПоМассивуРеквизитов(Объект, ТипОбъекта, Реквизиты, ТипУИ = Истина) Экспорт 
		
	Результат = "";
	
	Если Не ЗначениеЗаполнено(Объект)
		ИЛИ ТипЗнч(Реквизиты) <> Тип("Массив") 
		ИЛИ Не ЗначениеЗаполнено(Реквизиты) Тогда 
		
		Возврат Результат;
		
	КонецЕсли;	
	
	ВключенПривилегированныйРежим = Ложь;
	Если Не ПривилегированныйРежим() Тогда  
		ВключенПривилегированныйРежим = Истина;
		УстановитьПривилегированныйРежим(ВключенПривилегированныйРежим);	
	КонецЕсли;

	
	Запрос = Новый Запрос; 
	Запрос.Текст = "";
	
	НомерЭлемента = 0;
	Для Каждого элМассива Из Реквизиты Цикл
		
		ТекущийЭлемент = СокрЛП(элМассива);
		
		Попытка	
			текЗначение = ?(ТипУИ, XMLСтрока(Объект[ТекущийЭлемент]), ПолучитьНавигационнуюСсылку(Объект[ТекущийЭлемент]))	 
		Исключение
			текЗначение = Неопределено; 
			
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Объект: %1 
			|ТипОбъекта: %2
			|Реквизит: %3
			|Ошибка: %4'"), Строка(Объект), ТипОбъекта, ТекущийЭлемент, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
						
			PAPI_Логирование.ЗаписатьВЛог("PAPI.Ошибка", Перечисления.PAPI_ТипЛога.Ошибка, ТекстОшибки, "МодульМенеджера.PAPI_ОтборыПолучателей.ПолучателиОтбора");
			
		КонецПопытки;
		
		Если ЗначениеЗаполнено(текЗначение) Тогда 
			
			НомерЭлемента = НомерЭлемента + 1;	
			ФорматированноеЧисло = Формат(НомерЭлемента,"ЧДЦ=0; ЧГ=0");
			
			
			Если НомерЭлемента > 1 Тогда
				
				Запрос.Текст = Запрос.Текст + "
						|ОБЪЕДИНИТЬ ВСЕ
	                    |";

	        КонецЕсли;
			
			Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ РАЗЛИЧНЫЕ
						|	PAPI_ОтборыПолучателей.Получатель  КАК Получатель,
						|	PAPI_ОтборыПолучателей.Получатель.Наименование КАК Имя,
						|	1 КАК Счетчик
						|";
						
			Если НомерЭлемента = 1 Тогда			
						
				Запрос.Текст = Запрос.Текст + "ПОМЕСТИТЬ ВременнаяТаблица
						|";
				
			КонецЕсли;			
						
			Запрос.Текст = Запрос.Текст + "ИЗ
						|	РегистрСведений.PAPI_ОтборыПолучателей КАК PAPI_ОтборыПолучателей
						|ГДЕ
						|	PAPI_ОтборыПолучателей.ТипОбъекта = &ТипОбъекта
						|	И PAPI_ОтборыПолучателей.Реквизит = &Реквизит"+ФорматированноеЧисло+"
						|	И PAPI_ОтборыПолучателей.Значение = &Значение"+ФорматированноеЧисло+"
						|";		

			
			Запрос.УстановитьПараметр("Реквизит" + ФорматированноеЧисло, ТекущийЭлемент);
            Запрос.УстановитьПараметр("Значение" + ФорматированноеЧисло, текЗначение); 
		КонецЕсли;	
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст + " ;
                    |
					|////////////////////////////////////////////////////////////////////////////////
					|	ВЫБРАТЬ
					|	ВременнаяТаблица.Получатель КАК Получатель,
					|	ВременнаяТаблица.Имя КАК Имя,
					|	СУММА(ВременнаяТаблица.Счетчик) КАК Счетчик
					|ИЗ
					|	ВременнаяТаблица КАК ВременнаяТаблица
	                |
					|СГРУППИРОВАТЬ ПО
					|	ВременнаяТаблица.Получатель,
					|	ВременнаяТаблица.Имя
	                |
					|ИМЕЮЩИЕ
					|	СУММА(ВременнаяТаблица.Счетчик) = &Счетчик";
	
	Запрос.УстановитьПараметр("ТипОбъекта", ТипОбъекта); 
	
	// Если нужно чтобы возвращались получатели по всем переданным реквизитам тогда поставить Реквизиты.Количество()
	Запрос.УстановитьПараметр("Счетчик", НомерЭлемента);
	
		Если НомерЭлемента > 0 Тогда 
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаЗапроса = РезультатЗапроса.Выбрать();
		
		МассивИсполнителей = Новый Массив;
		Пока ВыборкаЗапроса.Следующий() Цикл 
			Если МассивИсполнителей.Найти(ВыборкаЗапроса.Имя) = Неопределено Тогда
				МассивИсполнителей.Добавить(ВыборкаЗапроса.Имя);	
			КонецЕсли;	
		КонецЦикла;	
		
		Если МассивИсполнителей.Количество() > 0 Тогда 
			Результат = СтрСоединить(МассивИсполнителей, ",");	
		КонецЕсли;	
		
	КонецЕсли;	
	
	Если ВключенПривилегированныйРежим Тогда 
		ВключенПривилегированныйРежим = Ложь;
		УстановитьПривилегированныйРежим(ВключенПривилегированныйРежим);	
	КонецЕсли;
	
	Возврат Результат;	
	
КонецФункции  

// Выборка получателей по переданному Отбору. Служит для фильтрации объектов по базам получателям. (Нужно переделать)
//
// Параметры:
//  Объект		 - ЛюбаяСсылка, Объект - Объект содержащий в себе фильтруемую информацию
//	ТипОбъекта	 - Строка - Текстовое представление типа объекта
//  Отбор	 	 - Структура - Структура в которой ключ наименование реквизитов
// 
// Возвращаемое значение:
//  Строка - Перечень получателей для СообщениеСервисаИнтеграции.КодПолучателя 
//
Функция ПолучателиОтборПоСтруктуре(Объект, ТипОбъекта, Отбор) Экспорт 
		
	Результат = "";
	
	Если Не ЗначениеЗаполнено(Объект)
		ИЛИ ТипЗнч(Отбор) <> Тип("Структура") 
		ИЛИ Не ЗначениеЗаполнено(Отбор) Тогда 
		
		Возврат Результат;
		
	КонецЕсли;	
	
	ВключенПривилегированныйРежим = Ложь;
	Если Не ПривилегированныйРежим() Тогда  
		ВключенПривилегированныйРежим = Истина;
		УстановитьПривилегированныйРежим(ВключенПривилегированныйРежим);	
	КонецЕсли;

	
	Запрос = Новый Запрос; 
	Запрос.Текст = "";
	
	НомерЭлемента = 0;
	Для Каждого элОтбора Из Отбор Цикл
		
		ТекущийРеквизит = СокрЛП(элОтбора.Ключ);
		ТекущееЗначение = СокрЛП(элОтбора.Значение);
		
		Если Не ПустаяСтрока(ТекущийРеквизит) Тогда 
			
			НомерЭлемента = НомерЭлемента + 1;	
			ФорматированноеЧисло = Формат(НомерЭлемента,"ЧДЦ=0; ЧГ=0");
				
			Если НомерЭлемента > 1 Тогда 
				
				Запрос.Текст = Запрос.Текст + "
						|ОБЪЕДИНИТЬ ВСЕ
	                    |";

	        КонецЕсли;
			
			Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ РАЗЛИЧНЫЕ
						|	PAPI_ОтборыПолучателей.Получатель  КАК Получатель,
						|	PAPI_ОтборыПолучателей.Получатель.Наименование КАК Имя,
						|	1 КАК Счетчик
						|";
						
			Если НомерЭлемента = 1 Тогда			
						
				Запрос.Текст = Запрос.Текст + "ПОМЕСТИТЬ ВременнаяТаблица
						|";
				
			КонецЕсли;			
						
			Запрос.Текст = Запрос.Текст + "ИЗ
						|	РегистрСведений.PAPI_ОтборыПолучателей КАК PAPI_ОтборыПолучателей
						|ГДЕ
						|	PAPI_ОтборыПолучателей.ТипОбъекта = &ТипОбъекта
						|	И PAPI_ОтборыПолучателей.Реквизит = &Реквизит"+ФорматированноеЧисло+"
						|	И PAPI_ОтборыПолучателей.Значение = &Значение"+ФорматированноеЧисло+"
						|";		

			
			Запрос.УстановитьПараметр("Реквизит" + ФорматированноеЧисло, ТекущийРеквизит);
            Запрос.УстановитьПараметр("Значение" + ФорматированноеЧисло, ТекущееЗначение); 
			
		КонецЕсли;	
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст + " ;
                    |
					|////////////////////////////////////////////////////////////////////////////////
					|	ВЫБРАТЬ
					|	ВременнаяТаблица.Получатель КАК Получатель,
					|	ВременнаяТаблица.Имя КАК Имя,
					|	СУММА(ВременнаяТаблица.Счетчик) КАК Счетчик
					|ИЗ
					|	ВременнаяТаблица КАК ВременнаяТаблица
	                |
					|СГРУППИРОВАТЬ ПО
					|	ВременнаяТаблица.Получатель,
					|	ВременнаяТаблица.Имя
	                |
					|ИМЕЮЩИЕ
					|	СУММА(ВременнаяТаблица.Счетчик) = &Счетчик";
	
	Запрос.УстановитьПараметр("ТипОбъекта", ТипОбъекта);
	Запрос.УстановитьПараметр("Счетчик", НомерЭлемента);

	Если НомерЭлемента > 0 Тогда 
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаЗапроса = РезультатЗапроса.Выбрать();
		
		МассивИсполнителей = Новый Массив;
		Пока ВыборкаЗапроса.Следующий() Цикл 
			Если МассивИсполнителей.Найти(ВыборкаЗапроса.Имя) = Неопределено Тогда
				МассивИсполнителей.Добавить(ВыборкаЗапроса.Имя);	
			КонецЕсли;	
		КонецЦикла;	
		
		Если МассивИсполнителей.Количество() > 0 Тогда 
			Результат = СтрСоединить(МассивИсполнителей, ",");	
		КонецЕсли;	
		
	КонецЕсли;	
	
	Если ВключенПривилегированныйРежим Тогда 
		ВключенПривилегированныйРежим = Ложь;
		УстановитьПривилегированныйРежим(ВключенПривилегированныйРежим);	
	КонецЕсли;
	
	Возврат Результат;	
	
КонецФункции
